InformationRegisters/ВременныеПараметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ВременныеПараметры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ВременныеПараметры/Ext/Module.bsl
Функция Получить(Ключ, Элемент = Неопределено) Экспорт
	Если Элемент = Неопределено Тогда
		Элемент = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВременныеПараметры.Значение КАК Значение,
	|	ВременныеПараметры.Строка КАК Строка
	|ИЗ
	|	РегистрСведений.ВременныеПараметры КАК ВременныеПараметры
	|ГДЕ
	|	Элемент = &Элемент И Ключ = &Ключ И (Срок >= &Срок ИЛИ Срок = ДАТАВРЕМЯ(1, 1, 1))");
	
	Запрос.УстановитьПараметр("Элемент", Элемент);
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("Срок", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.Значение), Выборка.Значение, Выборка.Строка);
	КонецЕсли;
КонецФункции

Функция Установить(Ключ, Значение, Срок = Неопределено, Элемент = Неопределено) Экспорт
	Если Элемент = Неопределено Тогда
		Элемент = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Запись = РегистрыСведений.ВременныеПараметры.СоздатьМенеджерЗаписи();
	Запись.Элемент = Элемент;
	Запись.Ключ = Ключ;
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Запись.Строка = Значение;
	Иначе
		Запись.Значение = Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Срок) Тогда
		Если ТипЗнч(Срок) = Тип("Дата") Тогда
			Запись.Срок = Срок;
		ИначеЕсли ТипЗнч(Срок) = Тип("Число") Тогда
			Запись.Срок = ТекущаяДата() + Срок;
		КонецЕсли;
	КонецЕсли;
	
	Запись.Записать(Истина);
КонецФункции

Функция Удалить(Ключ, Элемент = Неопределено) Экспорт
	Если Элемент = Неопределено Тогда
		Элемент = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	Набор = РегистрыСведений.ВременныеПараметры.СоздатьНаборЗаписей();
	Набор.Отбор.Элемент.Установить(ПараметрыСеанса.Пользователь);
	Набор.Отбор.Ключ.Установить(Ключ);
	Набор.Прочитать();
	
	Для Индекс = 1 - Набор.Количество() По 0 Цикл
		Набор.Удалить(-Индекс);
	КонецЦикла;
	
	Набор.Записать();
КонецФункции
